package kurvcygnus.soulnotes;

import io.quarkus.runtime.Quarkus;
import io.quarkus.runtime.annotations.QuarkusMain;

@QuarkusMain public final class Entrance
{
    public static void main(String... args)
    {
        //* 请不要把这里的打印换成[[Logger#info]].
        //* [[Logger]]对ASCII Art的支持不完善, 有肉眼可见的乱码问题.
        //* 而且没有 Log Header 会更酷.
        System.out.println(
            """
              █████████                      ████     ██████   █████           █████                     ███
             ███░░░░░███                    ░░███    ░░██████ ░░███           ░░███                     ░███
            ░███    ░░░   ██████  █████ ████ ░███     ░███░███ ░███   ██████  ███████    ██████   █████ ░███
            ░░█████████  ███░░███░░███ ░███  ░███     ░███░░███░███  ███░░███░░░███░    ███░░███ ███░░  ░███
             ░░░░░░░░███░███ ░███ ░███ ░███  ░███     ░███ ░░██████ ░███ ░███  ░███    ░███████ ░░█████ ░███
             ███    ░███░███ ░███ ░███ ░███  ░███     ░███  ░░█████ ░███ ░███  ░███ ███░███░░░   ░░░░███░░░
            ░░█████████ ░░██████  ░░████████ █████    █████  ░░█████░░██████   ░░█████ ░░██████  ██████  ███
             ░░░░░░░░░   ░░░░░░    ░░░░░░░░ ░░░░░    ░░░░░    ░░░░░  ░░░░░░     ░░░░░   ░░░░░░  ░░░░░░  ░░░
            
            Start Initializing...
            """
        );
        Quarkus.run(args);
    }
}
